app/controllers/answers_controller.rb

  def create
    question = Question.find(params[:answer][:question_id])
    question.answers.create(answer_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "answers" ("question_id", "email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 2], ["email", "bronzebrown@live.com"], ["body", "You are doing so now."], ["created_at", "2018-01-12 19:53:37.290058"], ["updated_at", "2018-01-12 19:53:37.290058"]]